# Atividade de Pandas

#### Conteúdo: 
- Leitura de Dados
- Estatistica Descritiva
- Agrupamento

In [1]:
import pandas as pd

### Leitura de Dados
abra o arquivo ``titanic.csv``

In [2]:
df = pd.read_csv('titanic.csv')

In [3]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,1305,NaN,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
1305,1306,NaN,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
1306,1307,NaN,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
1307,1308,NaN,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
1308,1309,NaN,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

##### Qual a idade média dos passegeiros?

In [4]:
df['Age'].mean()

29.881137667304014

##### Quais são as medianas para idade e tarifa dos passegeiros?

In [5]:
print('nMediana idade: ', df['Age'].median(), '\nMediana Tarifa: ', df['Fare'].median())

nMediana idade:  28.0
Mediana Tarifa:  14.4542

##### Mostre a descrição de todo o dataset?

In [6]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,1309.000000,891.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000
mean,655.000000,0.383838,2.294882,29.881138,0.498854,0.385027,33.295479
std,378.020061,0.486592,0.837836,14.413493,1.041658,0.865560,51.758668
min,1.000000,0.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,328.000000,0.000000,2.000000,21.000000,0.000000,0.000000,7.895800
50%,655.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,982.000000,1.000000,3.000000,39.000000,1.000000,0.000000,31.275000
max,1309.000000,1.000000,3.000000,80.000000,8.000000,9.000000,512.329200

##### Mostre uma agregação usando os valores, min, max, std and median para Age e min, max e median e mean para tarifa
- ``Dica``: crie um dicionário e use o método agg

In [10]:
df.agg({'Age': ['min', 'max', 'median', 'skew'],
        'Fare':['min', 'max', 'std', 'median','mean']
       })

              Age        Fare
min      0.170000    0.000000
max     80.000000  512.329200
median  28.000000   14.454200
skew     0.407675         NaN
std           NaN   51.758668
mean          NaN   33.295479

#### Mostre o sexo e a idade média entre os homens e mulheres

In [35]:
df[['Sex', 'Age']].groupby(['Sex']).mean()

              Age
Sex
female  28.687088
male    30.585228

###### Qual é o preço médio da passagem pelo sexo e classe de cabine?

In [37]:
df[['Sex', 'Cabin', 'Fare']].groupby(['Sex', 'Cabin']).mean()

                 Fare
Sex    Cabin
female A11    27.7208
       A16    39.6000
       A29    31.6792
       A34    81.8583
       B18    57.9792
...               ...
male   F G73   7.6500
       F2     22.7500
       F38     7.7500
       F4     39.0000
       T      35.5000

[235 rows x 1 columns]

###### Qual o número de registros por cabine

In [29]:
df.Cabin.value_counts()

C23 C25 C27        6
G6                 5
B57 B59 B63 B66    5
C22 C26            4
F33                4
                  ..
A14                1
E63                1
E12                1
E38                1
C105               1
Name: Cabin, Length: 186, dtype: int64